In [1]:
try:
    file = open('new_file.csv','x')
    file.close()
except:
    print('The file is already there....')

The file is already there....

In [ ]:
# if pandas not imported
# !pip install pandas

In [25]:
import pandas as pd
df = pd.read_csv('new_file.csv')
print(df)

   sn   name  age        add      phone
0   1    Ram   34  kathmandu    9876543
1   2  Shyam   22   lalitpur  984563782
2   3   Hari   25  bhaktapur   98357253
3   4   Rita   29  kathmandu  986545678
4   5  Nabin   32   lalitpur  985426715
5   6   kate   27    chitwan  986523456

In [26]:
import pandas as pd
df = pd.read_csv('new_file.csv',nrows = 2)
print(df)

   sn   name  age        add      phone
0   1    Ram   34  kathmandu    9876543
1   2  Shyam   22   lalitpur  984563782

In [4]:
import pandas as pd
df = pd.read_csv('new_file.csv')
print(df.head(3))

   sn   name  age        add      phone
0   1    Ram   34  Kathmandu    9876543
1   2  Shyam   22   lalitpur  984563782
2   3   Hari   25  bhaktapur   98357253

In [2]:
import pandas as pd
df = pd.read_csv('new_file.csv')
print(df.tail(3))

   sn   name  age        add      phone
3   4   Rita   29  kathmandu  986545678
4   5  Nabin   32   lalitpur  985426715
5   6   kate   27    chitwan  986523456

In [3]:
#index localizer --> row define 
df = pd.read_csv('new_file.csv')
print(df.iloc[0:4])

   sn   name  age        add      phone
0   1    Ram   34  kathmandu    9876543
1   2  Shyam   22   lalitpur  984563782
2   3   Hari   25  bhaktapur   98357253
3   4   Rita   29  kathmandu  986545678

In [4]:
df = pd.read_csv('new_file.csv')
print(df.iloc[0:4,0:3])

   sn   name  age
0   1    Ram   34
1   2  Shyam   22
2   3   Hari   25
3   4   Rita   29

In [5]:
df = pd.read_csv('new_file.csv',usecols = ['sn','name','phone'])
print(df)

   sn   name      phone
0   1    Ram    9876543
1   2  Shyam  984563782
2   3   Hari   98357253
3   4   Rita  986545678
4   5  Nabin  985426715
5   6   kate  986523456

In [29]:
df = pd.read_csv('new_file.csv')
df['name']

0      Ram
1    Shyam
2     Hari
3     Rita
4    Nabin
5     kate
Name: name, dtype: object

In [14]:
list(df['name'])

['Ram', 'Shyam', 'Hari', 'Rita', 'Nabin', 'kate']

In [6]:
df = pd.read_csv('new_file.csv')
df['name'] == 'Ram'

0     True
1    False
2    False
3    False
4    False
5    False
Name: name, dtype: bool

In [21]:
df[df['name'] == 'Ram']

   sn name  age        add    phone
0   1  Ram   34  Kathmandu  9876543

In [31]:
df[df['add'] == 'kathmandu']

   sn  name  age        add      phone
0   1   Ram   34  kathmandu    9876543
3   4  Rita   29  kathmandu  986545678

In [33]:
df[df['age'] > 20]

   sn   name  age        add      phone
0   1    Ram   34  kathmandu    9876543
1   2  Shyam   22   lalitpur  984563782
2   3   Hari   25  bhaktapur   98357253
3   4   Rita   29  kathmandu  986545678
4   5  Nabin   32   lalitpur  985426715
5   6   kate   27    chitwan  986523456

In [37]:
df[(df['age'] > 20) & (df['add'] == 'kathmandu')]

   sn  name  age        add      phone
0   1   Ram   34  kathmandu    9876543
3   4  Rita   29  kathmandu  986545678

In [41]:
data = df[(df['age'] > 30)]
data.to_csv('new_data_age.csv')

In [43]:
df = pd.read_csv('new_file.csv',index_col = 0)
print(df)

#here sn will act like an origin

     name  age        add      phone
sn
1     Ram   34  kathmandu    9876543
2   Shyam   22   lalitpur  984563782
3    Hari   25  bhaktapur   98357253
4    Rita   29  kathmandu  986545678
5   Nabin   32   lalitpur  985426715
6    kate   27    chitwan  986523456

In [46]:
df.loc[1:4]

     name  age        add      phone
sn
1     Ram   34  kathmandu    9876543
2   Shyam   22   lalitpur  984563782
3    Hari   25  bhaktapur   98357253
4    Rita   29  kathmandu  986545678

In [8]:
#json is light weighted 

data = {'name':['Ram','Shyam','Hari'],
       'age':[22,19,25],
       'add':['kathmandu','lalitpur','bhaktapur']}
df = pd.DataFrame(data)
df.to_csv('info.csv')
df.to_json('info.json')
df

    name  age        add
0    Ram   22  kathmandu
1  Shyam   19   lalitpur
2   Hari   25  bhaktapur

In [51]:
import csv
with open('info.csv') as csvfile:
    reader = csv.DictReader(csvfile)
    for row in reader:
        print(row)

{'': '0', 'name': 'Ram', 'age': '22', 'add': 'kathmandu'}
{'': '1', 'name': 'Shyam', 'age': '19', 'add': 'lalitpur'}
{'': '2', 'name': 'Hari', 'age': '25', 'add': 'bhaktapur'}

In [58]:
import csv
data = [['name','age','address'],
       ['Ram',32,'kathmandu'],
       ['Shyam',22,'lalitpur']]
file = open('list_file.csv','w')
x = csv.writer(file)
x.writerows(data)
file.close()

In [59]:
pwd

'C:\\Users\\Riya\\Desktop\\python'